Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet
A set that contains TemperatureRating types.

Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Insert(Autodesk.Revit.DB.Electrical.TemperatureRatingType)
System.Int32
Insert the specified TemperatureRating type into the set.
item: The TemperatureRating type to be inserted into the set.
Returns: Returns whether the TemperatureRating type was inserted into the set.

Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.ReverseIterator
Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.ForwardIterator
Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Erase(Autodesk.Revit.DB.Electrical.TemperatureRatingType)
System.Int32
Removes a specified TemperatureRating type from the set.
item: The TemperatureRating type to be erased.
Returns: The number of TemperatureRating types that were erased from the set.

Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Contains(Autodesk.Revit.DB.Electrical.TemperatureRatingType)
System.Boolean
Tests for the existence of a TemperatureRating type within the set.
item: The TemperatureRating type to be searched for.
Returns: The Contains method returns True if the TemperatureRating type is within the set, otherwise False.

Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Clear
void
Removes every TemperatureRating type from the set, rendering it empty.

Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Size
System.Int32
get
Returns the number of TemperatureRating types that are in the set.

Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.